week07/presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-25 Tue 11:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CMPUT201W20B2 Week 7</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abram Hindle" />
</head>
<body>
<div id="content">
<h1 class="title">CMPUT201W20B2 Week 7</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54a137a">1. Week7</a>
<ul>
<li><a href="#orgac53ae5">1.1. Copyright Statement</a>
<ul>
<li><a href="#org0561a25">1.1.1. License</a></li>
<li><a href="#org9c488b5">1.1.2. Hazel Code is licensed under AGPL3.0+</a></li>
</ul>
</li>
<li><a href="#orgc48150c">1.2. Init ORG-MODE</a></li>
<li><a href="#orgdbdb9d6">1.3. Org Template</a></li>
<li><a href="#org3c14437">1.4. Remember how to compile?</a></li>
<li><a href="#org43594f1">1.5. Enums!</a>
<ul>
<li><a href="#orgffbf499">1.5.1. Enum Example</a></li>
<li><a href="#org7fa1cae">1.5.2. enum<sub>typedef.c</sub></a></li>
<li><a href="#orgbcb8180">1.5.3. EnumStart</a></li>
<li><a href="#org022e465">1.5.4. Enumassign</a></li>
<li><a href="#orgde015d8">1.5.5. Enum<sub>loop</sub><sub>trick.c</sub></a></li>
<li><a href="#org000cde3">1.5.6. Enum Int</a></li>
<li><a href="#orge2f7a44">1.5.7. Another motivating ENUM Example</a></li>
</ul>
</li>
<li><a href="#org3f6c2a9">1.6. Unions</a>
<ul>
<li><a href="#org1e33030">1.6.1. Structs versus Unions</a></li>
<li><a href="#org0f471ad">1.6.2. Union considerations</a></li>
<li><a href="#orgb61eaf8">1.6.3. Type Punning</a></li>
<li><a href="#org4682847">1.6.4. Unions with type tags</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org54a137a" class="outline-2">
<h2 id="org54a137a"><span class="section-number-2">1</span> Week7</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgac53ae5" class="outline-3">
<h3 id="orgac53ae5"><span class="section-number-3">1.1</span> Copyright Statement</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you are in CMPUT201 at UAlberta this code is released in the public
domain to you.
</p>

<p>
Otherwise it is (c) 2020 Abram Hindle, Hazel Campbell AGPL3.0+
</p>
</div>

<div id="outline-container-org0561a25" class="outline-4">
<h4 id="org0561a25"><span class="section-number-4">1.1.1</span> License</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Week 3 notes
Copyright (C) 2020 Abram Hindle, Hazel Campbell
</p>

<p>
This program is free software: you can redistribute it and/or modify
it under the terms of the GNU Affero General Public License as
published by the Free Software Foundation, either version 3 of the
License, or (at your option) any later version.
</p>

<p>
This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU Affero General Public License for more details.
</p>

<p>
You should have received a copy of the GNU Affero General Public License
along with this program.  If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
</p>
</div>
</div>


<div id="outline-container-org9c488b5" class="outline-4">
<h4 id="org9c488b5"><span class="section-number-4">1.1.2</span> Hazel Code is licensed under AGPL3.0+</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Hazel's code is also found here
<a href="https://github.com/hazelybell/examples/tree/C-2020-01">https://github.com/hazelybell/examples/tree/C-2020-01</a>
</p>

<p>
Hazel code is licensed: The example code is licensed under the AGPL3+
license, unless otherwise noted.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc48150c" class="outline-3">
<h3 id="orgc48150c"><span class="section-number-3">1.2</span> Init ORG-MODE</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">I need this for org-mode to work well</span>

(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ob-sh</span>)
<span style="color: #b22222;">;</span><span style="color: #b22222;">(require 'ob-shell)</span>
(org-babel-do-load-languages 'org-babel-load-languages '((sh . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((C . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))
(<span style="color: #a020f0;">setq</span> org-src-fontify-natively t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbdb9d6" class="outline-3">
<h3 id="orgdbdb9d6"><span class="section-number-3">1.3</span> Org Template</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Copy and paste this to demo C
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>**<span style="color: #a0522d;">argv</span>) {
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c14437" class="outline-3">
<h3 id="org3c14437"><span class="section-number-3">1.4</span> Remember how to compile?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
gcc -std=c99 -Wall -pedantic -Werror -o programname programname.c
</p>
</div>
</div>


<div id="outline-container-org43594f1" class="outline-3">
<h3 id="org43594f1"><span class="section-number-3">1.5</span> Enums!</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Enums are enumerations, which is just a convienant way to make symbols
that have different values of the same type. Enums allow us to read
and write values from files and inputs and extract their symbolic meaning.
</p>

<p>
Enums are fundamental to symbolic computation.
</p>

<p>
Enum work good for switch cases, if statements, for loops.
</p>

<p>
Enums are good for representing the type of something or a category.
</p>
</div>

<div id="outline-container-orgffbf499" class="outline-4">
<h4 id="orgffbf499"><span class="section-number-4">1.5.1</span> Enum Example</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Enums are good for representing states, symbols, simple values, etc.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">N_DIRECTIONS</span> 4
<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">direction</span> {
    <span style="color: #a0522d;">UP</span>, <span style="color: #a0522d;">DOWN</span>, <span style="color: #a0522d;">LEFT</span>, <span style="color: #a0522d;">RIGHT</span>
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">direction</span> <span style="color: #228b22;">Direction</span>;

<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">direction_names</span>[N_DIRECTIONS] = {
    [UP] = <span style="color: #8b2252;">"Up"</span>,
    [DOWN] = <span style="color: #8b2252;">"Down"</span>,
    [LEFT] = <span style="color: #8b2252;">"Left"</span>,
    [RIGHT] = <span style="color: #8b2252;">"Right"</span>
};

<span style="color: #228b22;">Direction</span> <span style="color: #0000ff;">clockwise</span>(<span style="color: #228b22;">Direction</span> <span style="color: #a0522d;">direction</span>) {
    <span style="color: #a020f0;">switch</span> (direction) {
        <span style="color: #a020f0;">case</span> UP:
            <span style="color: #a020f0;">return</span> RIGHT;
        <span style="color: #a020f0;">case</span> RIGHT:
            <span style="color: #a020f0;">return</span> DOWN;
        <span style="color: #a020f0;">case</span> DOWN:
            <span style="color: #a020f0;">return</span> LEFT;
        <span style="color: #a020f0;">case</span> LEFT:
            <span style="color: #a020f0;">return</span> UP;
        <span style="color: #a020f0;">default</span>:
            abort();
    }
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">Direction</span> <span style="color: #a0522d;">d</span> = UP;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; 10; i++) {
        d = clockwise(d);
        printf(<span style="color: #8b2252;">"%d %s\t[%d]\n"</span>, i, direction_names[d], d);
    }
}
</pre>
</div>

<p>
0 Right	[3]
1 Down	[1]
2 Left	[2]
3 Up	[0]
4 Right	[3]
5 Down	[1]
6 Left	[2]
7 Up	[0]
8 Right	[3]
9 Down	[1]
</p>
</div>
</div>
