week07/presentation.html

<div id="outline-container-org7fa1cae" class="outline-4">
<h4 id="org7fa1cae"><span class="section-number-4">1.5.2</span> enum<sub>typedef.c</sub></h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Enums are annoying to type. Typing enum enumname all the time is
repetitive. Typedefs allow us to label enum types with 1 word.
</p>

<p>
Typedef this 
</p>

<p>
enum enumname { &#x2026; } ;
</p>

<p>
with:
</p>

<p>
typedef enum enunumae Enumename ;
</p>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span>,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">favourite</span> = VANILLA;
    printf(<span style="color: #8b2252;">"favourite=%d\n"</span>, favourite);
    printf(<span style="color: #8b2252;">"sizeof(favourite)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(favourite));

    <span style="color: #a020f0;">switch</span> (favourite) {
        <span style="color: #a020f0;">case</span> VANILLA:
            printf(<span style="color: #8b2252;">"favourite=VANILLA\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> CHOCOLATE:
            printf(<span style="color: #8b2252;">"favourite=CHOCOLATE\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> STRAWBERRY:
            printf(<span style="color: #8b2252;">"favourite=STRAWBERRY\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">default</span>:
            abort();
    }
}
</pre>
</div>

<p>
favourite=0
sizeof(favourite)=4
favourite=VANILLA
</p>
</div>
</div>



<div id="outline-container-orgbcb8180" class="outline-4">
<h4 id="orgbcb8180"><span class="section-number-4">1.5.3</span> EnumStart</h4>
<div class="outline-text-4" id="text-1-5-3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span> = 100,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"VANILLA=%d\n"</span>, VANILLA);
    printf(<span style="color: #8b2252;">"CHOCOLATE=%d\n"</span>, CHOCOLATE);
    printf(<span style="color: #8b2252;">"STRAWBERRY=%d\n"</span>, STRAWBERRY);
    printf(<span style="color: #8b2252;">"sizeof(Flavor)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(Flavor));
}
</pre>
</div>

<p>
VANILLA=100
CHOCOLATE=101
STRAWBERRY=102
sizeof(Flavor)=4
</p>
</div>
</div>

<div id="outline-container-org022e465" class="outline-4">
<h4 id="org022e465"><span class="section-number-4">1.5.4</span> Enumassign</h4>
<div class="outline-text-4" id="text-1-5-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span> = 100,
    <span style="color: #a0522d;">CHOCOLATE</span> = 200,
    <span style="color: #a0522d;">STRAWBERRY</span> = 300,
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"VANILLA=%d\n"</span>, VANILLA);
    printf(<span style="color: #8b2252;">"CHOCOLATE=%d\n"</span>, CHOCOLATE);
    printf(<span style="color: #8b2252;">"STRAWBERRY=%d\n"</span>, STRAWBERRY);
    printf(<span style="color: #8b2252;">"sizeof(Flavor)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(Flavor));
}
</pre>
</div>

<p>
VANILLA=100
CHOCOLATE=200
STRAWBERRY=300
sizeof(Flavor)=4
</p>
</div>
</div>

<div id="outline-container-orgde015d8" class="outline-4">
<h4 id="orgde015d8"><span class="section-number-4">1.5.5</span> Enum<sub>loop</sub><sub>trick.c</sub></h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
This is a fun trick to set a maximum value for your enum by using
another symbol
</p>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">this only works as long as we don't provide our</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">own values!</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span>,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
    <span style="color: #a0522d;">N_FLAVORS</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">Get the free max enum here</span>
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"VANILLA=%d\n"</span>, VANILLA);
    printf(<span style="color: #8b2252;">"CHOCOLATE=%d\n"</span>, CHOCOLATE);
    printf(<span style="color: #8b2252;">"STRAWBERRY=%d\n"</span>, STRAWBERRY);
    printf(<span style="color: #8b2252;">"N_FLAVORS=%d\n"</span>, N_FLAVORS);
    printf(<span style="color: #8b2252;">"sizeof(Flavor)=%zu\n"</span>,
           <span style="color: #a020f0;">sizeof</span>(Flavor));

    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span> = 0; flavor &lt; N_FLAVORS; flavor++) {
        <span style="color: #a020f0;">switch</span> (flavor) {
            <span style="color: #a020f0;">case</span> VANILLA:
                printf(<span style="color: #8b2252;">"flavor=VANILLA\n"</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">case</span> CHOCOLATE:
                printf(<span style="color: #8b2252;">"flavor=CHOCOLATE\n"</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">case</span> STRAWBERRY:
                printf(<span style="color: #8b2252;">"flavor=STRAWBERRY\n"</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">default</span>:
                abort();
        }
    }
}
</pre>
</div>

<p>
VANILLA=0
CHOCOLATE=1
STRAWBERRY=2
N<sub>FLAVORS</sub>=3
sizeof(Flavor)=4
flavor=VANILLA
flavor=CHOCOLATE
flavor=STRAWBERRY
</p>
</div>
</div>
