week07/presentation.html

<div id="outline-container-org000cde3" class="outline-4">
<h4 id="org000cde3"><span class="section-number-4">1.5.6</span> Enum Int</h4>
<div class="outline-text-4" id="text-1-5-6">
<p>
Enum are just integers. And you can treat them as such.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;time.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> {
    <span style="color: #a0522d;">VANILLA</span>,
    <span style="color: #a0522d;">CHOCOLATE</span>,
    <span style="color: #a0522d;">STRAWBERRY</span>,
    <span style="color: #a0522d;">N_FLAVORS</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">LOOK MA! No Defines! Cute trick, might surprise people.</span>
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">flavor</span> <span style="color: #228b22;">Flavor</span>;

<span style="color: #b22222;">// </span><span style="color: #b22222;">Here we use the fact that enums are really just ints!</span>
<span style="color: #228b22;">Flavor</span> <span style="color: #0000ff;">random_flavor</span>() {
    <span style="color: #a020f0;">return</span> (rand() % N_FLAVORS);
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">check_flavor</span>(<span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span>) {
    <span style="color: #a020f0;">if</span> (flavor &gt;= N_FLAVORS) {
        abort();
    }
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Since a flavor is just an int, it could be negative...</span>
    <span style="color: #a020f0;">if</span> (flavor &lt; 0) {
        abort();
    }
}

<span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #0000ff;">get_flavor_name</span>(<span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span>) {
    check_flavor(flavor);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Here we use "Designated Initializers"!</span>
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">flavor_names</span>[N_FLAVORS] = {
        [CHOCOLATE] = <span style="color: #8b2252;">"Hamburger flavor"</span>,
        [VANILLA] = <span style="color: #8b2252;">"Raspberry"</span>,
        [STRAWBERRY] = <span style="color: #8b2252;">"Those packets that come in the ramen"</span>
    };
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">flavor_name</span> = flavor_names[flavor];
    <span style="color: #a020f0;">return</span> flavor_name;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    srand(time(<span style="color: #008b8b;">NULL</span>));
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; 4; i++) {
       <span style="color: #228b22;">Flavor</span> <span style="color: #a0522d;">flavor</span> = random_flavor();
       printf(
           <span style="color: #8b2252;">"flavor %d = %s\n"</span>,
           flavor,
           get_flavor_name(flavor)
       );
    }
}
</pre>
</div>

<p>
flavor 1 = Hamburger flavor
flavor 1 = Hamburger flavor
flavor 2 = Those packets that come in the ramen
flavor 0 = Raspberry
</p>
</div>
</div>

<div id="outline-container-orge2f7a44" class="outline-4">
<h4 id="orge2f7a44"><span class="section-number-4">1.5.7</span> Another motivating ENUM Example</h4>
<div class="outline-text-4" id="text-1-5-7">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span> 
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;time.h&gt;</span>

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">card_face</span> {
    <span style="color: #a0522d;">ACE</span> = 1,
    <span style="color: #a0522d;">FACE2</span>,
    <span style="color: #a0522d;">FACE3</span>,
    <span style="color: #a0522d;">FACE4</span>,
    <span style="color: #a0522d;">FACE5</span>,
    <span style="color: #a0522d;">FACE6</span>,
    <span style="color: #a0522d;">FACE7</span>,
    <span style="color: #a0522d;">FACE8</span>,
    <span style="color: #a0522d;">FACE9</span>,
    <span style="color: #a0522d;">FACE10</span>,
    <span style="color: #a0522d;">JACK</span>,
    <span style="color: #a0522d;">QUEEN</span>,
    <span style="color: #a0522d;">KING</span>
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">card_face</span> <span style="color: #228b22;">CardFace</span>;

<span style="color: #a020f0;">enum</span> <span style="color: #228b22;">card_suit</span> {
    <span style="color: #a0522d;">CLUBS</span>,
    <span style="color: #a0522d;">HEARTS</span>,
    <span style="color: #a0522d;">DIAMONDS</span>,
    <span style="color: #a0522d;">SPADES</span>
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">card_suit</span> <span style="color: #228b22;">CardSuit</span>;

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">playing_card</span> {
    <span style="color: #228b22;">CardFace</span> <span style="color: #a0522d;">face</span>;
    <span style="color: #228b22;">CardSuit</span> <span style="color: #a0522d;">suit</span>;
};

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">playing_card</span> <span style="color: #228b22;">PlayingCard</span>;

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">HANDSIZE</span> 5

<span style="color: #b22222;">// </span><span style="color: #b22222;">A flush is a hand where all cards have the same suit</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">like 5 diamonds or 5 hearts</span>
<span style="color: #228b22;">bool</span> <span style="color: #0000ff;">isFlush</span>(<span style="color: #228b22;">PlayingCard</span> <span style="color: #a0522d;">hand</span>[HANDSIZE]) {
    <span style="color: #228b22;">CardSuit</span> <span style="color: #a0522d;">suit</span> = hand[0].suit;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 1;  i &lt; HANDSIZE; i++ ) {
        <span style="color: #a020f0;">if</span> (suit != hand[i].suit) {
            <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">false</span>;
        }
    }
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">true</span>;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    srand(time(<span style="color: #008b8b;">NULL</span>));
    <span style="color: #228b22;">PlayingCard</span> <span style="color: #a0522d;">hand</span>[5] = {
        {ACE, CLUBS},
        {FACE2, CLUBS},
        {KING, CLUBS},
        {JACK, CLUBS},
        {FACE4, CLUBS}
    };
    printf(<span style="color: #8b2252;">"isFlush? %u\n"</span>, isFlush(hand));
    <span style="color: #228b22;">PlayingCard</span> <span style="color: #a0522d;">secondHand</span>[5] = {
        {ACE, CLUBS},
        {ACE, SPADES},
        {ACE, HEARTS},
        {ACE, DIAMONDS},
        {ACE, CLUBS} <span style="color: #b22222;">// </span><span style="color: #b22222;">CHEATER</span>
    };
    printf(<span style="color: #8b2252;">"isFlush? %u\n"</span>, isFlush(secondHand));

}
</pre>
</div>

<p>
isFlush? 1
isFlush? 0
</p>
</div>
</div>
</div>
