week07/presentation.html



<div id="outline-container-org3f6c2a9" class="outline-3">
<h3 id="org3f6c2a9"><span class="section-number-3">1.6</span> Unions</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Unions are a way to all the same types to share the same memory.</li>
<li>Some types like unsigned integers have different sizes:</li>
</ul>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    printf(<span style="color: #8b2252;">"sizeof(unsigned char):\t\t%ld\n"</span>, 
        <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">char</span>));
    printf(<span style="color: #8b2252;">"sizeof(unsigned short):\t\t%ld\n"</span>, 
        <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">short</span>));
    printf(<span style="color: #8b2252;">"sizeof(unsigned int):\t\t%ld\n"</span>, 
        <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span>));
    printf(<span style="color: #8b2252;">"sizeof(unsigned long):\t\t%ld\n"</span>, 
        <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span>));
    printf(<span style="color: #8b2252;">"sizeof(unsigned long long):\t%ld\n"</span>, 
        <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #228b22;">long</span>));
    printf(<span style="color: #8b2252;">"sizeof(unsigned long long int):\t%ld\n"</span>, 
        <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #228b22;">long</span> <span style="color: #228b22;">int</span>));

}
</pre>
</div>

<p>
sizeof(unsigned char):		1
sizeof(unsigned short):		2
sizeof(unsigned int):		4
sizeof(unsigned long):		8
sizeof(unsigned long long):	8
sizeof(unsigned long long int):	8
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #a020f0;">union</span> <span style="color: #228b22;">uints</span> {
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">a_char</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">short</span> <span style="color: #a0522d;">a_short</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">a_long</span>;
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">union</span> <span style="color: #228b22;">uints</span> <span style="color: #228b22;">UInts</span>;

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">EXAMPLES</span> 7
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">longs</span>[EXAMPLES] = 
        { 0, 1000, 1000000, 10000000000, 
          65535, 4294967295, 18446744073709551615UL };
    <span style="color: #228b22;">UInts</span> <span style="color: #a0522d;">uints</span>;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; EXAMPLES; i++) {
        uints.a_long = longs[i];
        printf(<span style="color: #8b2252;">"For the long %lu:\n"</span>, longs[i]);
        printf(<span style="color: #8b2252;">"\tchar\t %hhu\n"</span>, uints.a_char);
        printf(<span style="color: #8b2252;">"\tshort\t %hu\n"</span>, uints.a_short);
        printf(<span style="color: #8b2252;">"\tint\t %u\n"</span>, uints.an_int);
        printf(<span style="color: #8b2252;">"\tlong\t %lu\n"</span>, uints.a_long);
    }
    <span style="color: #b22222;">// </span><span style="color: #b22222;">lets see if we can overflow</span>
    uints.a_char++;
    printf(<span style="color: #8b2252;">"Overflow kept local\t %lu\n"</span>, uints.a_long);
}
</pre>
</div>

<p>
For the long 0:
	char	 0
	short	 0
	int	 0
	long	 0
For the long 1000:
	char	 232
	short	 1000
	int	 1000
	long	 1000
For the long 1000000:
	char	 64
	short	 16960
	int	 1000000
	long	 1000000
For the long 10000000000:
	char	 0
	short	 58368
	int	 1410065408
	long	 10000000000
For the long 65535:
	char	 255
	short	 65535
	int	 65535
	long	 65535
For the long 4294967295:
	char	 255
	short	 65535
	int	 4294967295
	long	 4294967295
For the long 18446744073709551615:
	char	 255
	short	 65535
	int	 4294967295
	long	 18446744073709551615
Overflow kept local	 18446744073709551360
</p>
</div>
