week07/presentation.html

<div id="outline-container-org1e33030" class="outline-4">
<h4 id="org1e33030"><span class="section-number-4">1.6.1</span> Structs versus Unions</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">uints</span> {
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">a_char</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">short</span> <span style="color: #a0522d;">a_short</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">a_long</span>;
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">uints</span> <span style="color: #228b22;">UInts</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">UInts</span> <span style="color: #a0522d;">uints</span>;
    uints.a_long = 0;
    printf(<span style="color: #8b2252;">"Hi I'm a struct!\n"</span>);
    printf(<span style="color: #8b2252;">"sizeof(uints)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints));
    printf(<span style="color: #8b2252;">"sizeof(uints.a_char)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.a_char));
    printf(<span style="color: #8b2252;">"sizeof(uints.a_short)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.a_short));
    printf(<span style="color: #8b2252;">"sizeof(uints.an_int)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.an_int));
    printf(<span style="color: #8b2252;">"sizeof(uints.a_long)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.a_long));
    printf(<span style="color: #8b2252;">"&amp;uints=        %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;uints);
    printf(<span style="color: #8b2252;">"&amp;uints.a_char= %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.a_char));
    printf(<span style="color: #8b2252;">"&amp;uints.a_short=%p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.a_short));
    printf(<span style="color: #8b2252;">"&amp;uints.an_int= %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.an_int));
    printf(<span style="color: #8b2252;">"&amp;uints.a_long= %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.a_long));
}
</pre>
</div>

<p>
Hi I'm a struct!
sizeof(uints)=16
sizeof(uints.a<sub>char</sub>)=1
sizeof(uints.a<sub>short</sub>)=2
sizeof(uints.an<sub>int</sub>)=4
sizeof(uints.a<sub>long</sub>)=8
&amp;uints=        0x7ffcf221d760
&amp;uints.a<sub>char</sub>= 0x7ffcf221d760
&amp;uints.a<sub>short</sub>=0x7ffcf221d762
&amp;uints.an<sub>int</sub>= 0x7ffcf221d764
&amp;uints.a<sub>long</sub>= 0x7ffcf221d768
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #a020f0;">union</span> <span style="color: #228b22;">uints</span> {
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">a_char</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">short</span> <span style="color: #a0522d;">a_short</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span>;
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">a_long</span>;
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">union</span> <span style="color: #228b22;">uints</span> <span style="color: #228b22;">UInts</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">UInts</span> <span style="color: #a0522d;">uints</span>;
    uints.a_long = 0;
    printf(<span style="color: #8b2252;">"Hi I'm a Union!\n"</span>);
    printf(<span style="color: #8b2252;">"sizeof(uints)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints));
    printf(<span style="color: #8b2252;">"sizeof(uints.a_char)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.a_char));
    printf(<span style="color: #8b2252;">"sizeof(uints.a_short)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.a_short));
    printf(<span style="color: #8b2252;">"sizeof(uints.an_int)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.an_int));
    printf(<span style="color: #8b2252;">"sizeof(uints.a_long)=%zu\n"</span>, <span style="color: #a020f0;">sizeof</span>(uints.a_long));
    printf(<span style="color: #8b2252;">"&amp;uints=        %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;uints);
    printf(<span style="color: #8b2252;">"&amp;uints.a_char= %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.a_char));
    printf(<span style="color: #8b2252;">"&amp;uints.a_short=%p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.a_short));
    printf(<span style="color: #8b2252;">"&amp;uints.an_int= %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.an_int));
    printf(<span style="color: #8b2252;">"&amp;uints.a_long= %p\n"</span>, (<span style="color: #228b22;">void</span> *) &amp;(uints.a_long));
}
</pre>
</div>

<p>
Hi I'm a Union!
sizeof(uints)=8
sizeof(uints.a<sub>char</sub>)=1
sizeof(uints.a<sub>short</sub>)=2
sizeof(uints.an<sub>int</sub>)=4
sizeof(uints.a<sub>long</sub>)=8
&amp;uints=        0x7ffcb3c65120
&amp;uints.a<sub>char</sub>= 0x7ffcb3c65120
&amp;uints.a<sub>short</sub>=0x7ffcb3c65120
&amp;uints.an<sub>int</sub>= 0x7ffcb3c65120
&amp;uints.a<sub>long</sub>= 0x7ffcb3c65120
</p>
</div>
</div>


<div id="outline-container-org0f471ad" class="outline-4">
<h4 id="org0f471ad"><span class="section-number-4">1.6.2</span> Union considerations</h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li>they are aligned at the starting byte of each member.</li>
<li>overflows are kept local to the member being addressed</li>
</ul>
</div>
</div>

<div id="outline-container-orgb61eaf8" class="outline-4">
<h4 id="orgb61eaf8"><span class="section-number-4">1.6.3</span> Type Punning</h4>
<div class="outline-text-4" id="text-1-6-3">
<ul class="org-ul">
<li>Type punning is breaking the type system to achieve a goal</li>
<li>in C it is undefined behaviour to write to 1 part of the union
and then read from that data using a different overlapping
member. Yet it pretty common practice.</li>
<li>GCC and others typically allow it.</li>
</ul>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdint.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;limits.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">This is super useful, but we can't do it in C99</span>

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">multi_type</span> {
    <span style="color: #a020f0;">enum</span> {
        <span style="color: #a0522d;">NOTHING</span>,
        <span style="color: #a0522d;">AN_INT</span>,
        <span style="color: #a0522d;">A_FLOAT</span>
    } <span style="color: #a0522d;">which</span>;
    <span style="color: #a020f0;">union</span> {
        <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">an_int</span>;
        <span style="color: #228b22;">float</span> <span style="color: #a0522d;">a_float</span>;
    };
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">multi_type</span> <span style="color: #228b22;">MultiType</span>;

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">print_mt</span>(<span style="color: #228b22;">MultiType</span> <span style="color: #a0522d;">mt</span>) {
    <span style="color: #a020f0;">if</span> (mt.which == NOTHING) {
        printf(<span style="color: #8b2252;">"nothing"</span>);
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (mt.which == AN_INT) {
        printf(<span style="color: #8b2252;">"%d"</span>, (<span style="color: #228b22;">int</span>) mt.an_int);
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (mt.which == A_FLOAT) {
        printf(<span style="color: #8b2252;">"%e"</span>, mt.a_float);
    } <span style="color: #a020f0;">else</span> {
        abort();
    }
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">print_mt_array</span>(<span style="color: #228b22;">MultiType</span> *<span style="color: #a0522d;">mt_array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">length</span>) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">idx</span> = 0; idx &lt; length; idx++) {
        print_mt(mt_array[idx]);
        printf(<span style="color: #8b2252;">" "</span>);
    }
    printf(<span style="color: #8b2252;">"\n"</span>);
}

<span style="color: #228b22;">MultiType</span> <span style="color: #0000ff;">new_mt_int</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">value</span>) {
    <span style="color: #228b22;">MultiType</span> <span style="color: #a0522d;">new</span>;
    new.which = AN_INT;
    new.an_int = value;
    <span style="color: #a020f0;">return</span> new;
}

<span style="color: #228b22;">MultiType</span> <span style="color: #0000ff;">new_mt_float</span>(<span style="color: #228b22;">float</span> <span style="color: #a0522d;">value</span>) {
    <span style="color: #228b22;">MultiType</span> <span style="color: #a0522d;">new</span>;
    new.which = A_FLOAT;
    new.a_float = value;
    <span style="color: #a020f0;">return</span> new;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">MultiType</span> <span style="color: #a0522d;">mt_array</span>[4] = { { NOTHING } };
    mt_array[0] = new_mt_int(24);
    mt_array[1] = new_mt_int(48);
    mt_array[2] = new_mt_float(0.24);
    mt_array[3] = new_mt_float(0.12);
    printf(<span style="color: #8b2252;">"\n"</span>);
    print_mt_array(mt_array, 4);
}
</pre>
</div>

<p>
The error message:
</p>

<p>
/tmp/babel-27627ARt/C-src-27627FnU.c:24:6: error: ISO C99 doesnt support unnamed structs/unions [-Werror=pedantic]
     };
      ^
cc1: all warnings being treated as errors
/bin/bash: /tmp/babel-27627ARt/C-bin-27627Sxa: Permission denied
</p>
</div>
</div>
