week07/presentation.html


<div id="outline-container-org4682847" class="outline-4">
<h4 id="org4682847"><span class="section-number-4">1.6.4</span> Unions with type tags</h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
It is common practice to treat unions like "dynamic types". But it is
common practice to leave a hint in a tag to what type is actually
being stored in that union.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdint.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;limits.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #b22222;">// </span><span style="color: #b22222;">Multitype is either NOTHING, AN_INT, or A_FLOAT</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">You should read it and write it based on its type (which)</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">multi_type</span> {
    <span style="color: #a020f0;">enum</span> {
        <span style="color: #a0522d;">NOTHING</span>,
        <span style="color: #a0522d;">AN_INT</span>,
        <span style="color: #a0522d;">A_FLOAT</span>
    } <span style="color: #a0522d;">which</span>;
    <span style="color: #a020f0;">union</span> {
        <span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">an_int</span>;
        <span style="color: #228b22;">float</span> <span style="color: #a0522d;">a_float</span>;
    } <span style="color: #a0522d;">value</span>;
};
<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">multi_type</span> <span style="color: #228b22;">MultiType</span>;

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">print_mt</span>(<span style="color: #228b22;">MultiType</span> <span style="color: #a0522d;">mt</span>) {
    <span style="color: #a020f0;">if</span> (mt.which == NOTHING) {
        printf(<span style="color: #8b2252;">"nothing"</span>);
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (mt.which == AN_INT) {
        printf(<span style="color: #8b2252;">"%d"</span>, (<span style="color: #228b22;">int</span>) mt.value.an_int);
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (mt.which == A_FLOAT) {
        printf(<span style="color: #8b2252;">"%e"</span>, mt.value.a_float);
    } <span style="color: #a020f0;">else</span> {
        abort();
    }
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">print_mt_array</span>(<span style="color: #228b22;">MultiType</span> *<span style="color: #a0522d;">mt_array</span>, <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">length</span>) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">idx</span> = 0; idx &lt; length; idx++) {
        print_mt(mt_array[idx]);
        printf(<span style="color: #8b2252;">" "</span>);
    }
    printf(<span style="color: #8b2252;">"\n"</span>);
}
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">EXAMPLES</span> 6
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">MultiType</span> <span style="color: #a0522d;">mt_array</span>[EXAMPLES] = {
        { NOTHING },
        { AN_INT, { .an_int=10 } },
        { A_FLOAT, { .a_float=0.1 } },
        { NOTHING },
        { A_FLOAT, { .a_float=99.9 } },
        { AN_INT, { .an_int=99.9 } },
    };
    printf(<span style="color: #8b2252;">"\n"</span>);
    printf(<span style="color: #8b2252;">"sizeof(mt_array)    == %lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(mt_array));
    printf(<span style="color: #8b2252;">"sizeof(mt_array[0]) == %lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(mt_array[0]));
    printf(<span style="color: #8b2252;">"sizeof(mt_array[1]) == %lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(mt_array[0]));
    printf(<span style="color: #8b2252;">"sizeof(mt_array[2]) == %lu\n"</span>,<span style="color: #a020f0;">sizeof</span>(mt_array[0]));
    print_mt_array(mt_array, EXAMPLES);
}
</pre>
</div>

<p>
sizeof(mt<sub>array</sub>)    <code>= 48
sizeof(mt_array[0]) =</code> 8
sizeof(mt<sub>array</sub>[1]) <code>= 8
sizeof(mt_array[2]) =</code> 8
nothing 10 1.000000e-01 nothing 9.990000e+01 99
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abram Hindle</p>
<p class="date">Created: 2020-02-25 Tue 11:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
